//Задача – Паркинг со ограничен број на места (Semaphore)
//
//Да се имплементира симулација на паркинг користејќи нитки и семафор во Java:
//
//На паркингот има максимално 2 слободни места за паркирање.
//
//Постојат 5 автомобили, при што секој автомобил треба да биде претставен со посебна нитка.
//
//Секој автомобил:
//
//Прво треба да испечати порака дека чека слободно место за паркирање.
//
//Потоа треба да се обиде да „влезе“ на паркингот, при што не смее да има повеќе од 2 автомобили истовремено паркирани.
//
//Кога ќе успее да паркира, треба да испечати порака дека е паркиран и колку слободни места остануваат во моментот.
//
//Треба да остане паркиран одредено време (на пример од 1 до 3 секунди, случајно генерирано за секој автомобил).
//
//Потоа треба да испечати порака дека си заминува од паркингот и да го ослободи местото, по што повторно да се испечати колку слободни места има.
//
//Барања:
//
//Да се користи java.util.concurrent.Semaphore за ограничување на бројот на автомобили кои истовремено се наоѓаат на паркингот.
//
//Да се имплементира класа Car која го наследува Thread и во методот run() ја имплементира логиката за:
//
//чекање слободно место,
//
//паркирање (acquire на семафор),
//
//симулација на паркирање (sleep),
//
//заминување и ослободување на местото (release на семафор).
//
//Во main методот да се креираат и стартуваат 5 инстанци од класата Car (нитки) кои истовремено се обидуваат да паркираат на паркингот со 2 места.

package JavaNitki;



public class SimpleParkingSemaphoreAdvanced {


}
